Autodesk.Revit.DB.SubTransaction.HasEnded
Determines whether the sub-transaction has ended already.
Remarks:
A sub-transaction is ended by completing either the Commit
or RollBack method.
Another way of testing whether a sub-transaction has ended is by testing
its current status returned from (see Autodesk.Revit.DB.SubTransaction.GetStatus). It must be either
'TransactionStatus.Committed' or 'TransactionStatus.RolledBack'
Returns:
True if the sub-transaction has already been committed or rolled back, False otherwise.
Since:
2011

Autodesk.Revit.DB.SubTransaction.HasStarted
Determines whether the sub-transaction has been started yet.
Remarks:
A sub-transaction is considered being started after the Start
method was called and until the sub-transaction is either committed or rolled back.
Returns:
True if the sub-transaction has already started, False otherwise.
Since:
2011

Autodesk.Revit.DB.SubTransaction.GetStatus
Returns the current status of the sub-transaction.
Returns:
The current status of the sub-transaction.
Since:
2011

Autodesk.Revit.DB.SubTransaction.RollBack
Discards all changes made to the model during the sub-transaction.
Remarks:
The parent transaction (or a parent sub-transaction, if any)
can still be committed, but the changes rolled back by this
method will not be part of the committed transaction.
RollBack can be called only when all inner sub-transaction, if any, are finished,
i.e. they were either committed or rolled back. If there is still a sub-transaction open,
an attempt to roll this outer sub-transaction back will cause an exception.
Returns:
If finished successfully, this method returns TransactionStatus.RolledBack.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A sub-transaction can only be active inside an open Transaction.
-or-
The sub-transaction's current status is not TransactionStatus.Started,
therefore it may not be committed or rolled back.
Since:
2011

Autodesk.Revit.DB.SubTransaction.Commit
Commits all changes made to the model made during the sub-transaction.
Remarks:
The changes are not permanently committed to the document yet. They will be
committed only when the active transaction is committed. If the transaction
is rolled back instead, the changes committed during this sub-transaction will be discarded.
Commit can be called only when all inner sub-transactions, if any, are already finished,
i.e. they were either committed or rolled back. If there is still a sub-transaction open,
an attempt to commit this outer sub-transaction will cause an exception.
Returns:
If finished successfully, this method returns TransactionStatus.Committed
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A sub-transaction can only be active inside an open Transaction.
-or-
The sub-transaction's current status is not TransactionStatus.Started,
therefore it may not be committed or rolled back.
Since:
2011

Autodesk.Revit.DB.SubTransaction.Start
Starts the sub-transaction.
Remarks:
A sub-transaction can only be started in an open transaction,
and it must be closed (committed or rolled back) while still inside the open transaction.
A sub-transaction can be started in another open sub-transaction,
but then it must be closed before the parent sub-transaction is closed.
Returns:
If started successfully, this method returns TransactionStatus.Started.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled.
-or-
A sub-transaction can only be active inside an open Transaction.
-or-
The sub-transaction was already started and has not finished yet.
Since:
2011

Autodesk.Revit.DB.SubTransaction.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SubTransaction.#ctor(Autodesk.Revit.DB.Document)
Instantiates a sub-transaction object
document:
The document for which this sub-transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SubTransaction
Sub-transactions are objects that provide control over a subset of changes in a document.
Remarks:
A Sub-transaction can only be active as a part of an open transaction.
Sub-transactions may be nested inside each other, but with the restriction
that every nested sub-transaction is entirely contained (opened and closed)
in the parent sub-transaction.
If a sub-transaction was started and not committed or rolled back by the time
the SubTransaction object is about to be disposed, the destructor will roll back the
sub-transaction automatically, thus all changes made to the document during the
sub-transaction will be discarded. It is not recommended to rely on this default
behavior though. Instead, it is advised to always call either Commit
or RollBack explicitly before the sub-transaction
object gets disposed.
Please note that unless invoked explicitly the actual destruction of an object
in managed code might not happen until the object is collected by the garbage collector.
Since:
2011